{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "TIME_DELTA=1": 5,
      "TIME_DELTA=2": 6,
      "TIME_DELTA=4": 7,
      "TIME_DELTA=5": 8,
      "TIME_DELTA=24": 9,
      "TIME_DELTA=3": 10,
      "BAR_END": 11,
      "BAR_START": 12,
      "TIME_DELTA=8": 13,
      "TIME_DELTA=6": 14,
      "TIME_DELTA=12": 15,
      "NOTE_OFF=62": 16,
      "NOTE_ON=62": 17,
      "NOTE_OFF=67": 18,
      "NOTE_ON=67": 19,
      "NOTE_OFF=64": 20,
      "NOTE_ON=64": 21,
      "NOTE_OFF=59": 22,
      "NOTE_ON=59": 23,
      "NOTE_OFF=60": 24,
      "NOTE_ON=60": 25,
      "NOTE_OFF=66": 26,
      "NOTE_ON=66": 27,
      "NOTE_OFF=63": 28,
      "NOTE_ON=63": 29,
      "NOTE_OFF=65": 30,
      "NOTE_ON=65": 31,
      "NOTE_OFF=69": 32,
      "NOTE_ON=69": 33,
      "NOTE_OFF=57": 34,
      "NOTE_ON=57": 35,
      "NOTE_OFF=61": 36,
      "NOTE_ON=61": 37,
      "NOTE_OFF=71": 38,
      "NOTE_ON=71": 39,
      "NOTE_OFF=68": 40,
      "NOTE_ON=68": 41,
      "NOTE_OFF=58": 42,
      "NOTE_ON=58": 43,
      "NOTE_OFF=74": 44,
      "NOTE_ON=74": 45,
      "NOTE_OFF=72": 46,
      "NOTE_ON=72": 47,
      "NOTE_OFF=70": 48,
      "NOTE_ON=70": 49,
      "NOTE_OFF=55": 50,
      "NOTE_ON=55": 51,
      "NOTE_OFF=76": 52,
      "NOTE_ON=76": 53,
      "NOTE_OFF=73": 54,
      "NOTE_ON=73": 55,
      "NOTE_OFF=75": 56,
      "NOTE_ON=75": 57,
      "NOTE_OFF=56": 58,
      "NOTE_ON=56": 59,
      "INST=0": 60,
      "TRACK_END": 61,
      "TRACK_START": 62,
      "NOTE_OFF=77": 63,
      "NOTE_ON=77": 64,
      "NOTE_OFF=54": 65,
      "NOTE_ON=54": 66,
      "NOTE_OFF=52": 67,
      "NOTE_ON=52": 68,
      "NOTE_OFF=79": 69,
      "NOTE_ON=79": 70,
      "NOTE_OFF=53": 71,
      "NOTE_ON=53": 72,
      "NOTE_OFF=78": 73,
      "NOTE_ON=78": 74,
      "TIME_DELTA=16": 75,
      "NOTE_OFF=50": 76,
      "NOTE_ON=50": 77,
      "NOTE_OFF=80": 78,
      "NOTE_ON=80": 79,
      "NOTE_OFF=48": 80,
      "NOTE_ON=48": 81,
      "NOTE_OFF=51": 82,
      "NOTE_ON=51": 83,
      "NOTE_OFF=81": 84,
      "NOTE_ON=81": 85,
      "NOTE_OFF=47": 86,
      "NOTE_ON=47": 87,
      "NOTE_OFF=49": 88,
      "NOTE_ON=49": 89,
      "NOTE_OFF=45": 90,
      "NOTE_ON=45": 91,
      "NOTE_OFF=43": 92,
      "NOTE_ON=43": 93,
      "NOTE_OFF=82": 94,
      "NOTE_ON=82": 95,
      "NOTE_OFF=46": 96,
      "NOTE_ON=46": 97,
      "NOTE_OFF=44": 98,
      "NOTE_ON=44": 99,
      "PIECE_START": 100,
      "NOTE_OFF=83": 101,
      "NOTE_ON=83": 102,
      "NOTE_OFF=84": 103,
      "NOTE_ON=84": 104,
      "NOTE_OFF=41": 105,
      "NOTE_ON=41": 106,
      "NOTE_OFF=42": 107,
      "NOTE_ON=42": 108,
      "NOTE_OFF=40": 109,
      "NOTE_ON=40": 110,
      "NOTE_OFF=86": 111,
      "NOTE_ON=86": 112,
      "NOTE_OFF=85": 113,
      "NOTE_ON=85": 114,
      "NOTE_OFF=38": 115,
      "NOTE_ON=38": 116,
      "NOTE_OFF=39": 117,
      "NOTE_ON=39": 118,
      "NOTE_OFF=87": 119,
      "NOTE_ON=87": 120,
      "NOTE_OFF=88": 121,
      "NOTE_ON=88": 122,
      "NOTE_OFF=37": 123,
      "NOTE_ON=37": 124,
      "NOTE_OFF=89": 125,
      "NOTE_ON=89": 126,
      "NOTE_OFF=36": 127,
      "NOTE_ON=36": 128,
      "NOTE_OFF=90": 129,
      "NOTE_ON=90": 130,
      "NOTE_OFF=91": 131,
      "NOTE_ON=91": 132,
      "NOTE_OFF=35": 133,
      "NOTE_ON=35": 134,
      "NOTE_OFF=92": 135,
      "NOTE_ON=92": 136,
      "NOTE_OFF=34": 137,
      "NOTE_ON=34": 138,
      "NOTE_OFF=32": 139,
      "NOTE_ON=32": 140,
      "NOTE_OFF=93": 141,
      "NOTE_ON=93": 142,
      "NOTE_OFF=33": 143,
      "NOTE_ON=33": 144,
      "NOTE_OFF=30": 145,
      "NOTE_ON=30": 146,
      "NOTE_OFF=94": 147,
      "NOTE_ON=94": 148,
      "NOTE_OFF=31": 149,
      "NOTE_ON=31": 150,
      "NOTE_OFF=95": 151,
      "NOTE_ON=95": 152,
      "NOTE_OFF=28": 153,
      "NOTE_ON=28": 154,
      "NOTE_OFF=96": 155,
      "NOTE_ON=96": 156,
      "NOTE_OFF=26": 157,
      "NOTE_ON=26": 158,
      "NOTE_OFF=29": 159,
      "NOTE_ON=29": 160,
      "NOTE_OFF=27": 161,
      "NOTE_ON=27": 162,
      "NOTE_OFF=97": 163,
      "NOTE_ON=97": 164,
      "NOTE_OFF=98": 165,
      "NOTE_ON=98": 166,
      "NOTE_OFF=100": 167,
      "NOTE_ON=100": 168,
      "NOTE_OFF=101": 169,
      "NOTE_ON=101": 170,
      "NOTE_OFF=99": 171,
      "NOTE_ON=99": 172,
      "NOTE_OFF=24": 173,
      "NOTE_ON=24": 174,
      "NOTE_OFF=103": 175,
      "NOTE_ON=103": 176,
      "NOTE_OFF=102": 177,
      "NOTE_ON=102": 178,
      "NOTE_OFF=105": 179,
      "NOTE_ON=105": 180,
      "NOTE_OFF=25": 181,
      "NOTE_ON=25": 182,
      "NOTE_OFF=106": 183,
      "NOTE_ON=106": 184
    },
    "unk_token": "[UNK]"
  }
}