{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 185,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "TIME_DELTA=24": 5,
      "TIME_DELTA=1": 6,
      "TIME_DELTA=2": 7,
      "BAR_END": 8,
      "BAR_START": 9,
      "TIME_DELTA=5": 10,
      "TIME_DELTA=4": 11,
      "TIME_DELTA=8": 12,
      "TIME_DELTA=12": 13,
      "TIME_DELTA=3": 14,
      "TIME_DELTA=6": 15,
      "NOTE_OFF=62": 16,
      "NOTE_ON=62": 17,
      "NOTE_OFF=60": 18,
      "NOTE_ON=60": 19,
      "NOTE_OFF=64": 20,
      "NOTE_ON=64": 21,
      "INST=0": 22,
      "TRACK_END": 23,
      "TRACK_START": 24,
      "NOTE_OFF=59": 25,
      "NOTE_ON=59": 26,
      "NOTE_OFF=57": 27,
      "NOTE_ON=57": 28,
      "NOTE_OFF=63": 29,
      "NOTE_ON=63": 30,
      "NOTE_OFF=61": 31,
      "NOTE_ON=61": 32,
      "NOTE_OFF=67": 33,
      "NOTE_ON=67": 34,
      "NOTE_OFF=65": 35,
      "NOTE_ON=65": 36,
      "NOTE_OFF=58": 37,
      "NOTE_ON=58": 38,
      "NOTE_OFF=66": 39,
      "NOTE_ON=66": 40,
      "TIME_DELTA=16": 41,
      "NOTE_OFF=55": 42,
      "NOTE_ON=55": 43,
      "NOTE_OFF=69": 44,
      "NOTE_ON=69": 45,
      "NOTE_OFF=68": 46,
      "NOTE_ON=68": 47,
      "NOTE_OFF=56": 48,
      "NOTE_ON=56": 49,
      "NOTE_OFF=71": 50,
      "NOTE_ON=71": 51,
      "NOTE_OFF=72": 52,
      "NOTE_ON=72": 53,
      "NOTE_OFF=70": 54,
      "NOTE_ON=70": 55,
      "NOTE_OFF=74": 56,
      "NOTE_ON=74": 57,
      "NOTE_OFF=73": 58,
      "NOTE_ON=73": 59,
      "NOTE_OFF=75": 60,
      "NOTE_ON=75": 61,
      "NOTE_OFF=76": 62,
      "NOTE_ON=76": 63,
      "NOTE_OFF=54": 64,
      "NOTE_ON=54": 65,
      "NOTE_OFF=52": 66,
      "NOTE_ON=52": 67,
      "NOTE_OFF=53": 68,
      "NOTE_ON=53": 69,
      "NOTE_OFF=77": 70,
      "NOTE_ON=77": 71,
      "NOTE_OFF=50": 72,
      "NOTE_ON=50": 73,
      "NOTE_OFF=78": 74,
      "NOTE_ON=78": 75,
      "PIECE_START": 76,
      "NOTE_OFF=48": 77,
      "NOTE_ON=48": 78,
      "NOTE_OFF=79": 79,
      "NOTE_ON=79": 80,
      "NOTE_OFF=51": 81,
      "NOTE_ON=51": 82,
      "NOTE_OFF=47": 83,
      "NOTE_ON=47": 84,
      "NOTE_OFF=45": 85,
      "NOTE_ON=45": 86,
      "NOTE_OFF=49": 87,
      "NOTE_ON=49": 88,
      "NOTE_OFF=80": 89,
      "NOTE_ON=80": 90,
      "NOTE_OFF=43": 91,
      "NOTE_ON=43": 92,
      "NOTE_OFF=46": 93,
      "NOTE_ON=46": 94,
      "NOTE_OFF=81": 95,
      "NOTE_ON=81": 96,
      "NOTE_OFF=44": 97,
      "NOTE_ON=44": 98,
      "NOTE_OFF=82": 99,
      "NOTE_ON=82": 100,
      "NOTE_OFF=41": 101,
      "NOTE_ON=41": 102,
      "NOTE_OFF=42": 103,
      "NOTE_ON=42": 104,
      "NOTE_OFF=40": 105,
      "NOTE_ON=40": 106,
      "NOTE_OFF=83": 107,
      "NOTE_ON=83": 108,
      "NOTE_OFF=84": 109,
      "NOTE_ON=84": 110,
      "NOTE_OFF=39": 111,
      "NOTE_ON=39": 112,
      "NOTE_OFF=38": 113,
      "NOTE_ON=38": 114,
      "NOTE_OFF=86": 115,
      "NOTE_ON=86": 116,
      "NOTE_OFF=85": 117,
      "NOTE_ON=85": 118,
      "NOTE_OFF=37": 119,
      "NOTE_ON=37": 120,
      "NOTE_OFF=36": 121,
      "NOTE_ON=36": 122,
      "NOTE_OFF=87": 123,
      "NOTE_ON=87": 124,
      "NOTE_OFF=88": 125,
      "NOTE_ON=88": 126,
      "NOTE_OFF=89": 127,
      "NOTE_ON=89": 128,
      "NOTE_OFF=90": 129,
      "NOTE_ON=90": 130,
      "NOTE_OFF=91": 131,
      "NOTE_ON=91": 132,
      "NOTE_OFF=35": 133,
      "NOTE_ON=35": 134,
      "NOTE_OFF=92": 135,
      "NOTE_ON=92": 136,
      "NOTE_OFF=34": 137,
      "NOTE_ON=34": 138,
      "NOTE_OFF=93": 139,
      "NOTE_ON=93": 140,
      "NOTE_OFF=33": 141,
      "NOTE_ON=33": 142,
      "NOTE_OFF=32": 143,
      "NOTE_ON=32": 144,
      "NOTE_OFF=94": 145,
      "NOTE_ON=94": 146,
      "NOTE_OFF=31": 147,
      "NOTE_ON=31": 148,
      "NOTE_OFF=30": 149,
      "NOTE_ON=30": 150,
      "NOTE_OFF=95": 151,
      "NOTE_ON=95": 152,
      "NOTE_OFF=96": 153,
      "NOTE_ON=96": 154,
      "NOTE_OFF=28": 155,
      "NOTE_ON=28": 156,
      "NOTE_OFF=29": 157,
      "NOTE_ON=29": 158,
      "NOTE_OFF=26": 159,
      "NOTE_ON=26": 160,
      "NOTE_OFF=98": 161,
      "NOTE_ON=98": 162,
      "NOTE_OFF=97": 163,
      "NOTE_ON=97": 164,
      "NOTE_OFF=100": 165,
      "NOTE_ON=100": 166,
      "NOTE_OFF=27": 167,
      "NOTE_ON=27": 168,
      "NOTE_OFF=99": 169,
      "NOTE_ON=99": 170,
      "NOTE_OFF=101": 171,
      "NOTE_ON=101": 172,
      "NOTE_OFF=24": 173,
      "NOTE_ON=24": 174,
      "NOTE_OFF=103": 175,
      "NOTE_ON=103": 176,
      "NOTE_OFF=102": 177,
      "NOTE_ON=102": 178,
      "NOTE_OFF=105": 179,
      "NOTE_ON=105": 180,
      "NOTE_OFF=25": 181,
      "NOTE_ON=25": 182,
      "NOTE_OFF=106": 183,
      "NOTE_ON=106": 184,
      "[UNK]": 185
    },
    "unk_token": "<unk>"
  }
}